laravel/app/Http/Controllers/ShopController.php

select `id` from `roles` where `role` = 'BDE'
---
	public function deleteArticle($n) {
		$bde = Model\Role::select('id')->where('role', 'BDE')->get()[0]->id;